#pragma clang diagnostic push
#pragma ide diagnostic ignored "bugprone-reserved-identifier"
#include <ntifs.h>
#include <ntstrsafe.h>
#include <CaveHook.h>

#define Log(format, ...) DbgPrintEx(0, 0, format, __VA_ARGS__)

extern "C" {
    typedef enum _SYSTEM_INFORMATION_CLASS {
        SystemBasicInformation, // q: SYSTEM_BASIC_INFORMATION
        SystemProcessorInformation, // q: SYSTEM_PROCESSOR_INFORMATION
        SystemPerformanceInformation, // q: SYSTEM_PERFORMANCE_INFORMATION
        SystemTimeOfDayInformation, // q: SYSTEM_TIMEOFDAY_INFORMATION
        SystemPathInformation, // not implemented
        SystemProcessInformation, // q: SYSTEM_PROCESS_INFORMATION
        SystemCallCountInformation, // q: SYSTEM_CALL_COUNT_INFORMATION
        SystemDeviceInformation, // q: SYSTEM_DEVICE_INFORMATION
        SystemProcessorPerformanceInformation, // q: SYSTEM_PROCESSOR_PERFORMANCE_INFORMATION (EX in: USHORT ProcessorGroup)
        SystemFlagsInformation, // q: SYSTEM_FLAGS_INFORMATION
        SystemCallTimeInformation, // not implemented // SYSTEM_CALL_TIME_INFORMATION // 10
        SystemModuleInformation, // q: RTL_PROCESS_MODULES
        SystemLocksInformation, // q: RTL_PROCESS_LOCKS
        SystemStackTraceInformation, // q: RTL_PROCESS_BACKTRACES
        SystemPagedPoolInformation, // not implemented
        SystemNonPagedPoolInformation, // not implemented
        SystemHandleInformation, // q: SYSTEM_HANDLE_INFORMATION

        SystemPoolLimitInformation, // SYSTEM_POOL_LIMIT_INFORMATION (requires SeIncreaseQuotaPrivilege)
        SystemCodeIntegrityAddDynamicStore,
        SystemCodeIntegrityClearDynamicStores,
        SystemDifPoolTrackingInformation,
        SystemPoolZeroingInformation, // q: SYSTEM_POOL_ZEROING_INFORMATION
        SystemDpcWatchdogInformation, // q; s: SYSTEM_DPC_WATCHDOG_CONFIGURATION_INFORMATION
        SystemDpcWatchdogInformation2, // q; s: SYSTEM_DPC_WATCHDOG_CONFIGURATION_INFORMATION_V2
        SystemSupportedProcessorArchitectures2, // q: in opt: HANDLE, out: SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION[] // NtQuerySystemInformationEx // 230
        SystemSingleProcessorRelationshipInformation, // q: SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX // (EX in: PROCESSOR_NUMBER Processor)
        SystemXfgCheckFailureInformation, // q: SYSTEM_XFG_FAILURE_INFORMATION
        SystemIommuStateInformation, // SYSTEM_IOMMU_STATE_INFORMATION // since 22H1
        SystemHypervisorMinrootInformation, // SYSTEM_HYPERVISOR_MINROOT_INFORMATION
        SystemHypervisorBootPagesInformation, // SYSTEM_HYPERVISOR_BOOT_PAGES_INFORMATION
        SystemPointerAuthInformation, // SYSTEM_POINTER_AUTH_INFORMATION
        SystemSecureKernelDebuggerInformation,
        SystemOriginalImageFeatureInformation, // q: in: SYSTEM_ORIGINAL_IMAGE_FEATURE_INFORMATION_INPUT, out: SYSTEM_ORIGINAL_IMAGE_FEATURE_INFORMATION_OUTPUT // NtQuerySystemInformationEx
        SystemMemoryNumaInformation, // SYSTEM_MEMORY_NUMA_INFORMATION_INPUT, SYSTEM_MEMORY_NUMA_INFORMATION_OUTPUT
        SystemMemoryNumaPerformanceInformation, // SYSTEM_MEMORY_NUMA_PERFORMANCE_INFORMATION_INPUTSYSTEM_MEMORY_NUMA_PERFORMANCE_INFORMATION_INPUT, SYSTEM_MEMORY_NUMA_PERFORMANCE_INFORMATION_OUTPUT // since 24H2 // 240
        SystemCodeIntegritySignedPoliciesFullInformation,
        SystemSecureSecretsInformation,
        SystemTrustedAppsRuntimeInformation, // SYSTEM_TRUSTEDAPPS_RUNTIME_INFORMATION
        SystemBadPageInformationEx, // SYSTEM_BAD_PAGE_INFORMATION
        SystemResourceDeadlockTimeout, // ULONG
        SystemBreakOnContextUnwindFailureInformation, // ULONG (requires SeDebugPrivilege)
        SystemOslRamdiskInformation, // SYSTEM_OSL_RAMDISK_INFORMATION
        MaxSystemInfoClass
    } SYSTEM_INFORMATION_CLASS;

    enum _LDR_DLL_LOAD_REASON {
        LoadReasonStaticDependency = 0,
        LoadReasonStaticForwarderDependency = 1,
        LoadReasonDynamicForwarderDependency = 2,
        LoadReasonDelayloadDependency = 3,
        LoadReasonDynamicLoad = 4,
        LoadReasonAsImageLoad = 5,
        LoadReasonAsDataLoad = 6,
        LoadReasonEnclavePrimary = 7,
        LoadReasonEnclaveDependency = 8,
        LoadReasonPatchImage = 9,
        LoadReasonUnknown = -1
    };

    enum _LDR_HOT_PATCH_STATE {
        LdrHotPatchBaseImage = 0,
        LdrHotPatchNotApplied = 1,
        LdrHotPatchAppliedReverse = 2,
        LdrHotPatchAppliedForward = 3,
        LdrHotPatchFailedToPatch = 4,
        LdrHotPatchStateMax = 5
    };

    typedef struct _LDR_DATA_TABLE_ENTRY {
        struct _LIST_ENTRY InLoadOrderLinks; //0x0
        struct _LIST_ENTRY InMemoryOrderLinks; //0x10
        struct _LIST_ENTRY InInitializationOrderLinks; //0x20
        VOID *DllBase; //0x30
        VOID *EntryPoint; //0x38
        ULONG SizeOfImage; //0x40
        struct _UNICODE_STRING FullDllName; //0x48
        struct _UNICODE_STRING BaseDllName; //0x58
        union {
            UCHAR FlagGroup[4]; //0x68
            ULONG Flags; //0x68
            struct {
                ULONG PackagedBinary: 1; //0x68
                ULONG MarkedForRemoval: 1; //0x68
                ULONG ImageDll: 1; //0x68
                ULONG LoadNotificationsSent: 1; //0x68
                ULONG TelemetryEntryProcessed: 1; //0x68
                ULONG ProcessStaticImport: 1; //0x68
                ULONG InLegacyLists: 1; //0x68
                ULONG InIndexes: 1; //0x68
                ULONG ShimDll: 1; //0x68
                ULONG InExceptionTable: 1; //0x68
                ULONG ReservedFlags1: 2; //0x68
                ULONG LoadInProgress: 1; //0x68
                ULONG LoadConfigProcessed: 1; //0x68
                ULONG EntryProcessed: 1; //0x68
                ULONG ProtectDelayLoad: 1; //0x68
                ULONG ReservedFlags3: 2; //0x68
                ULONG DontCallForThreads: 1; //0x68
                ULONG ProcessAttachCalled: 1; //0x68
                ULONG ProcessAttachFailed: 1; //0x68
                ULONG CorDeferredValidate: 1; //0x68
                ULONG CorImage: 1; //0x68
                ULONG DontRelocate: 1; //0x68
                ULONG CorILOnly: 1; //0x68
                ULONG ChpeImage: 1; //0x68
                ULONG ChpeEmulatorImage: 1; //0x68
                ULONG ReservedFlags5: 1; //0x68
                ULONG Redirected: 1; //0x68
                ULONG ReservedFlags6: 2; //0x68
                ULONG CompatDatabaseProcessed: 1; //0x68
            };
        };
        USHORT ObsoleteLoadCount; //0x6c
        USHORT TlsIndex; //0x6e
        struct _LIST_ENTRY HashLinks; //0x70
        ULONG TimeDateStamp; //0x80
        struct _ACTIVATION_CONTEXT *EntryPointActivationContext; //0x88
        VOID *Lock; //0x90
        struct _LDR_DDAG_NODE *DdagNode; //0x98
        struct _LIST_ENTRY NodeModuleLink; //0xa0
        struct _LDRP_LOAD_CONTEXT *LoadContext; //0xb0
        VOID *ParentDllBase; //0xb8
        VOID *SwitchBackContext; //0xc0
        struct _RTL_BALANCED_NODE BaseAddressIndexNode; //0xc8
        struct _RTL_BALANCED_NODE MappingInfoIndexNode; //0xe0
        ULONGLONG OriginalBase; //0xf8
        union _LARGE_INTEGER LoadTime; //0x100
        ULONG BaseNameHashValue; //0x108
        enum _LDR_DLL_LOAD_REASON LoadReason; //0x10c
        ULONG ImplicitPathOptions; //0x110
        ULONG ReferenceCount; //0x114
        ULONG DependentLoadFlags; //0x118
        UCHAR SigningLevel; //0x11c
        ULONG CheckSum; //0x120
        VOID *ActivePatchImageBase; //0x128
        enum _LDR_HOT_PATCH_STATE HotPatchState; //0x130
    } LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;
}

typedef struct _RTL_PROCESS_MODULE_INFORMATION {
    ULONG Section;
    PVOID MappedBase;
    PVOID ImageBase;
    ULONG ImageSize;
    ULONG Flags;
    USHORT LoadOrderIndex;
    USHORT InitOrderIndex;
    USHORT LoadCount;
    USHORT OffsetToFileName;
    CHAR FullPathName[MAXIMUM_FILENAME_LENGTH];
} RTL_PROCESS_MODULE_INFORMATION, *PRTL_PROCESS_MODULE_INFORMATION;

typedef struct _RTL_PROCESS_MODULES {
    ULONG NumberOfModules;
    RTL_PROCESS_MODULE_INFORMATION Modules[];
} RTL_PROCESS_MODULES, *PRTL_PROCESS_MODULES;

typedef NTSTATUS(*DRIVER_ENTRYPOINT)(PDRIVER_OBJECT, PUNICODE_STRING);

extern "C" {
    NTKERNELAPI PVOID NTAPI RtlFindExportedRoutineByName(
            IN PVOID ImageBase,
            IN PCCH RoutineName
    );

    NTSTATUS NTAPI ZwQuerySystemInformation(
            IN SYSTEM_INFORMATION_CLASS SystemInformationClass,
